
// MutationObserver наблюдает за загрузкой кода 
let observe = new MutationObserver((mutatio) => {
	console.log(mutatio)
})

////observer.disconnect() – останавливает наблюдение.
//MutationObserver может реагировать на изменения в DOM: атрибуты, добавленные/удалённые элементы, текстовое содержимое.

//Мы можем использовать его, чтобы отслеживать изменения, производимые другими частями нашего собственного кода, а также интегрироваться со сторонними библиотеками.

//MutationObserver может отслеживать любые изменения. Разные опции конфигурации «что наблюдать» предназначены для оптимизации, чтобы не тратить ресурсы на лишние вызовы колбэка.