//Аргумент то к чему применяется оператор

5 * 2  // 5  2 Аргумент      * оператор


Унарный

let x = 1;

  x = -x;

  console.log(x)
// Унарный оператор который применяется к одному аргументу

Бинарный 
// оператор который применяется к двум аргументам
 
let z = 5;  y = 3;

console.log( x - y);// - является бинарным оператором


//Оператор взятия остатка %

console.log( 8 % 3 );

//  Возведение в степень **

console.log(4** (3/2))

// Сложевние строк с помощью бинарного плюса
  let c = 'maya' + 'strong';

 console.log(c);


 // Приведегие к чису

 let q = trye;

 console.log( +q)

 Преобразует не числа в числа

 let orang = 3;
 let apple = 5;

 console.log( +orang + apple);

//  Примсваивание 

let r = 23;
let v = 34;

let c = r + v ( r = v + 1)
console.log(r)
console.log(v)

// Присваивание по цепочке

a = b = c = 1 + 1;

console.log(a)
